config.org
#+TITLE: He-Macs
#+SUBTITLE: Henry's GNU Emacs literate config
#+AUTHOR: hmatheisen
#+LANGUAGE: en

#+BEGIN_QUOTE
I have the power! - [[https://www.youtube.com/watch?v=4zIoElk3r2c][He-Man]]
#+END_QUOTE

* Table of Contents :TOC:noexport:
- [[#what-is-this][What is this?]]
  - [[#abstract][Abstract]]
  - [[#why-though][Why though?]]
  - [[#installation][Installation]]
- [[#creating-the-files][Creating the files]]
  - [[#files-to-ignore][Files to ignore]]
  - [[#initel][=init.el=]]
- [[#initialization][Initialization]]
  - [[#custom-constantsvariables][Custom constants/variables]]
  - [[#add-package-archives][Add package archives]]
  - [[#install-use-package][Install use-package]]
  - [[#require-personal-packages][Require personal packages]]
- [[#global-settings][Global settings]]
  - [[#settings-without-packages][Settings without packages]]
  - [[#custom][Custom]]
  - [[#mail][Mail]]
  - [[#gnus][Gnus]]
  - [[#terminal-binary][Terminal binary]]
  - [[#window][Window]]
  - [[#windmove][WindMove]]
  - [[#y-or-n--yes-or-no][Y or N > Yes or No]]
  - [[#time-mode][Time mode]]
  - [[#simple][Simple]]
  - [[#display-battery-level][Display battery level]]
  - [[#line-numbers][Line numbers]]
  - [[#files][Files]]
  - [[#frame-settings][Frame settings]]
  - [[#faces][Faces]]
  - [[#winner-mode][Winner mode]]
  - [[#modern-region-behavior][Modern region behavior]]
  - [[#no-scroll-bar][No scroll bar]]
  - [[#matching-parentheses][Matching Parentheses]]
  - [[#ediff][Ediff]]
  - [[#auto-pair][Auto-pair]]
  - [[#use-ibuffer][Use ibuffer]]
  - [[#compile][Compile]]
  - [[#info][Info]]
  - [[#js][JS]]
  - [[#shell-script][Shell script]]
  - [[#align][Align]]
  - [[#mwheel][MWheel]]
- [[#third-party-packages][Third-party Packages]]
  - [[#themes][Themes]]
  - [[#diminish][Diminish]]
  - [[#ivy][Ivy]]
  - [[#code-completion][Code Completion]]
  - [[#org-mode][Org Mode]]
  - [[#markdown-mode][Markdown mode]]
  - [[#magit][Magit]]
  - [[#flycheck][Flycheck]]
  - [[#projectile][Projectile]]
  - [[#neotree][Neotree]]
  - [[#which-key][Which key]]
  - [[#undo-tree][Undo tree]]
  - [[#all-the-icons][All the icons]]
  - [[#dashboard][Dashboard]]
  - [[#snippets][Snippets]]
  - [[#clojure][Clojure]]
  - [[#typescript][Typescript]]
  - [[#docker][Docker]]
  - [[#yaml][YAML]]
  - [[#go][Go]]
  - [[#latex][LaTeX]]
  - [[#rvm][RVM]]
  - [[#ruby][Ruby]]
  - [[#olivetty][Olivetty]]
  - [[#terraform][Terraform]]
  - [[#beacon][Beacon]]
  - [[#imenu-list][IMenu-list]]
  - [[#evil][Evil]]
- [[#personal-packages][Personal Packages]]
  - [[#new-term][New Term]]
  - [[#theme-switcher][Theme Switcher]]
- [[#closing-files][Closing files]]
  - [[#initel-1][=init.el=]]

* What is this?

Let's forget about this dumb play on words between my name and a
cartoon from the 80's and actually explain what this file is.

** Abstract

This is my attempt at writing a literate Emacs configuration using
Org, a "simple outliner for note-taking and list management" that
actually does way more.  Although this configuration is for myself and
is opinionated, anyone is free to watch, copy or use its content.

** Why though?

Fame?  No.  Fun?  Maybe.  Having your whole configuration in a single
file might be a little messy but a literate file such as this one
looks like a neat idea to organize and document my dear Emacs
configuration.  Of course the file will eventually be gigantic but Org
Mode makes it easy to manage.  Documentation is also a huge plus since
I usually get lost in the maze of Emacs Lisp that is my current
config.

** Installation

All you need to do is to clone this repository, I added the tangled
file to git so the =init.el= is already here.  Since I use submodules,
you need to clone recursively this repository.

#+BEGIN_SRC bash
# Maybe backup you files first
mv ~/.emacs.d ~/.emacs.bak
#+END_SRC

#+BEGIN_SRC bash
git clone --recursive https://github.com/hmatheisen/.emacs.d.git ~/.emacs.d
#+END_SRC

* Creating the files

** Files to ignore

This is my =.gitignore= file.

#+BEGIN_SRC text :tangle .gitignore
.backups/
.cache/
.lsp-session-v1
auto-save-list/
bookmarks
custom.el
elpa/
games/
ido.last
nov-places
network-security.data
newsticker
projectile-bookmarks.eld
projectile.cache
recentf
todos.org
tramp
transient/
#+END_SRC

** =init.el=

#+BEGIN_SRC emacs-lisp :tangle init.el
;;; init.el --- Emacs Init File

;;; Commentary:
;;; My Emacs Init File
;;; This file is generted by `config.org', since there are no comments in here,
;;; you should go have a look there for more information.

;;; Code:
#+END_SRC

* Initialization

These are the first few lines of code that start it all.  They go into
=init.el= and will be added to git since they are needed to install
Org on a new system and therefore read this file ton install the rest
of the configuration.  I will keep maintaining =init.el= in this file
since =org-babel-tangle= just rewrites the file if new modifications
are made.

** Custom constants/variables

#+BEGIN_SRC emacs-lisp :tangle init.el
(defconst *is-a-mac* (eq system-type 'darwin)
  "Check whether system is mac.")
(defconst *mono-font* "JetBrains Mono"
  "Mono font to be used")
(defconst *font-size* 12
  "Font size in points")
#+END_SRC

** Add package archives

Setup MELPA repositories.

#+BEGIN_SRC emacs-lisp :tangle init.el
(require 'package)
(add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives '("org"   . "https://orgmode.org/elpa/"))
(setq package-enable-at-startup nil)
(package-initialize)
#+END_SRC

** Install use-package

=use-package= is quite handy and will allow us to require and install
packages in a tidy way, we install it here and make sure it installs
the packages we want by default.

#+BEGIN_SRC emacs-lisp :tangle init.el
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  (require 'use-package-ensure)
  (setq use-package-always-ensure t))
#+END_SRC

** Require personal packages

Those packages are installed with git submodules.  They are isolated
packages written by me so they don't need any description here.  We
just add them to load path so that =use-package= can do the job later.

#+BEGIN_SRC emacs-lisp :tangle init.el
(add-to-list 'load-path "~/.emacs.d/site-lisp/theme-switcher")
(add-to-list 'load-path "~/.emacs.d/site-lisp/new-term")
#+END_SRC

* Global settings

These are settings to change the look/behavior of Emacs using only
native options.  I regroup them by their package using =use-package=.
There is nothing really fancy happening here, just cleaning up the UI
and setting some variables.  Since I always ensure packages by
default, I make sure to add =:ensure nil= on native packages so
=use-package= does not try to look for them in MELPA.

** Settings without packages

These are settings defined in the C source code of emacs so they are
not related to any Lisp packages, let's put them in a package called
=emacs=.

*** Macos

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package emacs
  :ensure nil
  :config
  ;; Avoid a few issues on MacOS
  (when *is-a-mac*
    (setq mac-option-modifier 'meta
          mac-command-modifier 'super
          mac-right-option-modifier 'nil
          select-enable-clipboard t))
  ;; title bar settings
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
  (add-to-list 'default-frame-alist '(ns-appearance . dark))
  (setq ns-use-proxy-icon  nil)
  (setq frame-title-format nil))
#+END_SRC

*** UI/UX

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package emacs
  :ensure nil
  :config
  ;; Remove Toolbar
  (tool-bar-mode -1)
  ;; Disable menu bar
  (menu-bar-mode -1)
  ;; Enable downcase/upcase region
  (put 'downcase-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
  ;; Trash can support
  (when *is-a-mac*
    (setq trash-directory "~/.Trash"))
  (setq delete-by-moving-to-trash t)
  ;; Indent using spaces
  (setq-default indent-tabs-mode nil)
  ;; Set tabs to 2
  (setq-default tab-width 2)
  ;; Make that damn bell shut up
  (setq ring-bell-function 'ignore)
  ;; Default truncate lines
  (setq-default truncate-lines t)
  ;; Unbind suspend keys
  (global-unset-key (kbd "C-z"))
  (global-unset-key (kbd "C-x C-z")))
#+END_SRC

*** Garbage collection

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package emacs
  :ensure nil
  :preface
  (defun garbage-collect-defer ()
    "Defer garbage collection."
    (setq gc-cons-threshold most-positive-fixnum
          gc-cons-percentage 0.6))
  (defun garbage-collect-restore ()
    "Return garbage collection to slightly higher parameter."
    (setq gc-cons-threshold 100000000
          gc-cons-percentage 0.1))
  :config
  ;; Set garbage collection
  (garbage-collect-defer)
  (add-hook 'emacs-startup-hook #'garbage-collect-restore)
  (add-hook 'minibuffer-setup-hook #'garbage-collect-defer)
  (add-hook 'minibuffer-exit-hook #'garbage-collect-restore))
#+END_SRC

*** Path

#+BEGIN_SRC emacs-lisp :tangle init.el
;; Resolve path issues
(use-package emacs
  :preface
  (defun add-to-path (path)
    "Add a path to `exec-path' and Emacs \"PATH\" variable."
    (add-to-list 'exec-path path)
    (setenv "PATH" (concat (getenv "PATH") ":" path)))
  :ensure nil
  :config
  ;; Add useful path to exec-path and PATH
  (add-to-path "/usr/local/bin")
  (add-to-path "/Library/TeX/texbin")
  (add-to-path "~/go/bin")
  (add-to-path "~/.cargo/bin"))
#+END_SRC

*** UTF-8

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package emacs
  :ensure nil
  :config
  ;; Set utf8 everywhere
  (prefer-coding-system 'utf-8)
  (setq locale-coding-system 'utf-8)
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8))
#+END_SRC

*** Half scroll

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package emacs
  :ensure nil
  :preface
  (defun zz-scroll-half-page (direction)
    "Scrolls half page up if `direction' is non-nil, otherwise will scroll half page down."
    (let ((opos (cdr (nth 6 (posn-at-point)))))
      ;; opos = original position line relative to window
      (move-to-window-line nil)  ;; Move cursor to middle line
      (if direction
          (recenter-top-bottom -1)  ;; Current line becomes last
        (recenter-top-bottom 0))  ;; Current line becomes first
      (move-to-window-line opos)))  ;; Restore cursor/point position

  (defun zz-scroll-half-page-down ()
    "Scrolls exactly half page down keeping cursor/point position."
    (interactive)
    (zz-scroll-half-page nil))

  (defun zz-scroll-half-page-up ()
    "Scrolls exactly half page up keeping cursor/point position."
    (interactive)
    (zz-scroll-half-page t))
  :config
  (global-set-key (kbd "C-v") 'zz-scroll-half-page-down)
  (global-set-key (kbd "M-v") 'zz-scroll-half-page-up))
#+END_SRC

** Custom

The custom file is not really useful here since every parameter is set
using elisp.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package custom
  :ensure nil
  :config
  (setq custom-safe-themes t)
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory)))
#+END_SRC

