config.org
** Mail

Setup auth information.  =.authinfo.gpg= file is the encrypted
authentication source file used by different backends.  We tell Emacs
to use this file for authentication.  Then setup user full name and
mail address.  Two GPG related environment variables are created to
make decryption work inside Emacs.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package auth-source
  :ensure nil
  :config
  (setq auth-sources '("~/.authinfo.gpg" "~/.authinfo"))
  (setq user-full-name "Henry MATHEISEN")
  (setq user-mail-address "henry.mthsn@gmail.com")
  ;; Disable external pin entry
  (setenv "GPG_AGENT_INFO" nil)
  ;; Solve ioctl common error with GPG
  (setenv "GPG_TTY" "$(tty)"))
#+END_SRC

Configure default SMTP server.  This allows Emacs to look for the
right line in the =.authinfo.gpg= when it needs credentials.  We use
SSL to encrypt sent mails.  And set Emacs to use SMTP as the main mail
sending method.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package smtpmail
  :config
  (setq smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 465
        smtpmail-stream-type 'ssl
        ;; Set smtp method for sending mail
        send-mail-function 'smtpmail-send-it
        message-send-mail-function 'message-smtpmail-send-it))
#+END_SRC

Message mode is the mode I use to send mails.  Here, we tell it to
sign mail with my name and mail address.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package message
  :ensure nil
  :config
  (setq mail-signature "Henry MATHEISEN\nhenry.mthsn@gmail.com\n"
        message-signature "Henry MATHEISEN\nhenry.mthsn@gmail.com\n"))
#+END_SRC

Using Emacs GUI, I want an internal pinentry program.  EPA allows to
use Emacs Minibuffer for GPG pinentry.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package "epa-file"
  :ensure nil
  :config
  (setq epa-pinentry-mode 'loopback))
#+END_SRC

** Gnus

Gnus early configuration.  Only reads mail from my Gmail account for
now.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package gnus
  :defer t
  :ensure nil
  :config
  (setq gnus-select-method '(nnnil))
  (setq gnus-secondary-select-methods
        '((nnimap "GMAIL"
                 (nnimap-address "imap.gmail.com")
                 (nnimap-server-port "imaps")
                 (nnimap-stream ssl))))
  ;; Make Gnus NOT ignore [Gmail] mailboxes
  (setq gnus-ignored-newsgroups "^to\\.\\|^[0-9. ]+\\( \\|$\\)\\|^[\"]\"[#'()]"))
#+END_SRC

** Terminal binary

On MacOS, I use a new version of =bash= installed with =brew= since I
can't update the default one. Therefore the path is changed to
=/usr/local/bin/bash=.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package term
  :ensure nil
  :config
  (if *is-a-mac*
      (setq explicit-shell-file-name "/usr/local/bin/bash")
    (setq explicit-shell-file-name "/bin/bash")))
#+END_SRC

** Window

Change keybindings to resize window so I can just keep pressing them.
Also I change the default keybindings to go to another window since
=C-x o= is a little too long in my opinion.  It is now remapped to
=ace-window= which is handy when the number of windows starts to grow.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package "window"
    :ensure nil
    :preface
    (defun hma/split-window-right ()
      "Splits window on the right then focus on that window"
      (interactive)
      (split-window-right)
      (other-window 1))
    (defun hma/split-window-below ()
      "Splits windmow below then focus on that window"
      (interactive)
      (split-window-below)
      (other-window 1))
    :config
    ;; Resizing
    (global-set-key (kbd "M--") 'shrink-window)
    (global-set-key (kbd "M-+") 'enlarge-window)
    (global-set-key (kbd "C--") 'shrink-window-horizontally)
    (global-set-key (kbd "C-+") 'enlarge-window-horizontally)
    ;; Other window (windmove is also setup but this can be easier)
    (global-set-key (kbd "M-o") 'other-window)
    (global-set-key (kbd "M-O") '(lambda ()
                                   (interactive)
                                   (other-window -1)))
    ;; scroll window up/down by one line
    (global-set-key (kbd "M-n") '(lambda ()
                                   (interactive)
                                   (scroll-up-command 1)))
    (global-set-key (kbd "M-p") '(lambda ()
                                   (interactive)
                                   (scroll-down-command 1)))
    ;; Use by own split functions
    (global-set-key (kbd "C-x 2") 'hma/split-window-below)
    (global-set-key (kbd "C-x 3") 'hma/split-window-right)
    (global-set-key (kbd "C-<tab>") 'next-buffer)
    (global-set-key (kbd "C-S-<tab>") 'previous-buffer))

  (use-package ace-window
    :config (global-set-key (kbd "C-x o") 'ace-window))
#+END_SRC

** WindMove

Use windmove to move around multiple windows easily

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package windmove
  :ensure nil
  :config
  (windmove-default-keybindings))
#+END_SRC

** Y or N > Yes or No

Answer by =y= or =n= instead of =yes= of =no=.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package "subr"
  :ensure nil
  :config (fset 'yes-or-no-p 'y-or-n-p))
#+END_SRC

** Time mode

Display time on mode line.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package time
  :ensure nil
  :config (display-time-mode t))
#+END_SRC

** Simple

Display line numbers in mode line and undo keybinding.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package simple
  :ensure nil
  :config
  (column-number-mode t)
  (global-set-key (kbd "s-<backspace>")
                  (lambda ()
                    (interactive)
                    (kill-line 0))))
#+END_SRC

** Display battery level

Display battery level inm mode line.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package battery
  :ensure nil
  :config (display-battery-mode t))
#+END_SRC

** Line numbers

Display line numbers every =prog-mode=.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package display-line-numbers
  :ensure nil
  :hook (prog-mode . display-line-numbers-mode)
        (yaml-mode . display-line-numbers-mode))
#+END_SRC

** Files

Make sure that all backup files only exist in one place and always ask
before quitting Emacs.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package files
  :ensure nil
  :config
  (setq backup-directory-alist '(("." . "~/.emacs.d/.backups")))
  (setq confirm-kill-emacs #'yes-or-no-p))
#+END_SRC

** Frame settings

Enable full frame on Emacs startup.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package frame
  :ensure nil
  :config
  (add-hook 'after-init-hook 'toggle-frame-fullscreen))
#+END_SRC

** Faces

Set the different fonts

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package faces
  :ensure nil
  :config
  (set-face-attribute 'default
                      nil
                      :family *mono-font*
                      :height (* *font-size* 10))

  (set-face-attribute 'fixed-pitch
                      nil
                      :family *mono-font*
                      :height (* *font-size* 10))

  (set-face-attribute 'variable-pitch
                      nil
                      :family "Raleway"
                      :height (* *font-size* 12)))
#+END_SRC

** Winner mode

Allows to revert changes on the window configuration.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package winner
  :ensure nil
  :config (winner-mode t))
#+END_SRC

** Modern region behavior

Replace the active region when typing/yanking text, which is a little
handier than the default behaviour.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package delsel
  :ensure nil
  :config (delete-selection-mode +1))
#+END_SRC

** No scroll bar

I mean who likes this, really?

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package scroll-bar
  :ensure nil
  :config (scroll-bar-mode -1))
#+END_SRC

** Matching Parentheses

Show matching paren, quite useful for every languages especially Lisp!

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package paren
  :ensure nil
  :init (setq show-paren-delay 0)
  :config (show-paren-mode t))
#+END_SRC

** Ediff

Enter ediff with side-by-side buffers to better compare the
differences.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package ediff
  :ensure nil
  :config (setq ediff-split-window-function 'split-window-horizontally))
#+END_SRC

** Auto-pair

Auto close quote, parentheses, brackets, etc.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package elec-pair
  :ensure nil
  :hook (prog-mode . electric-pair-mode))
#+END_SRC

** Use ibuffer

Use ibuffer instead of default list buffer.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package "ibuffer"
  :ensure nil
  :config
  ;; Replace command to ibuffer
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  ;; Filter groups
  (setq ibuffer-saved-filter-groups
        '(("default"
           ("buffers"      (or (name . "\*dashboard\*")
                               (name . "\*scratch\*")))
           ("clojure"      (or (mode . clojure-mode)
                               (name . "\*cider")
                               (name . "\*nrepl")))
           ("magit"        (name . "magit*"))
           ("he-macs"      (filename . ".emacs.d"))
           ("org"          (mode . org-mode))
           ("dired"        (mode . dired-mode))
           ("code"         (filename . "Projets")))))
  ;; Add hook
  (add-hook 'ibuffer-mode-hook
            '(lambda ()
               (ibuffer-switch-to-saved-filter-groups "default")))
  ;; Do not show groups that are empty
  (setq ibuffer-show-empty-filter-groups nil)
  ;; Do not prompt when deleting a new buffer
  (setq ibuffer-expert t))
#+END_SRC

** Compile

Set keybinding for the recompile command.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package compile
  :ensure nil
  :config
  (global-set-key (kbd "C-c C-k") 'recompile))
#+END_SRC

