config.org
** Info

Change one =info-mode= keybinding to my scroll command.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package info
  :ensure nil
  :config
  (define-key Info-mode-map (kbd "M-n") '(lambda ()
                                           (interactive)
                                           (scroll-up-command 1))))
#+END_SRC

** JS

Set indent level for javascript/json files.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package js
  :ensure nil
  :config
  (setq js-indent-level 2))
#+END_SRC

** Shell script

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package sh-script
  :ensure nil
  :config (setq sh-basic-offset 2))
#+END_SRC

** Align

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package align
  :ensure nil
  :config
  (defun hma/align-equals (beg end)
    "Align `=' signs in a given region."
    (interactive "r")
    (align-regexp beg
                  end
                  "\\(\\s-*\\)=")))
#+END_SRC

** MWheel

Settings concerning mouse scroll in GUI

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package mwheel
  :ensure nil
  :config (setq mouse-wheel-progressive-speed nil
                mouse-wheel-scroll-amount '(1 ((shift) . 1))))
#+END_SRC

* Third-party Packages

Here are all the packages I require from MELPA.

** Themes

Currently using the perfect Modus themes.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package modus-vivendi-theme
  :defer t
  :init
  (setq modus-vivendi-theme-distinct-org-blocks t
        modus-vivendi-theme-rainbow-headings t
        modus-vivendi-theme-slanted-constructs t
        modus-vivendi-theme-bold-constructs t
        modus-vivendi-theme-scale-headings t
        modus-vivendi-theme-scale-1 1.05
        modus-vivendi-theme-scale-2 1.1
        modus-vivendi-theme-scale-3 1.15
        modus-vivendi-theme-scale-4 1.2))
(use-package modus-operandi-theme
  :defer t
  :init
  (setq modus-operandi-theme-distinct-org-blocks t
        modus-operandi-theme-rainbow-headings t
        modus-operandi-theme-slanted-constructs t
        modus-operandi-theme-bold-constructs t
        modus-operandi-theme-scale-headings t
        modus-operandi-theme-scale-1 1.05
        modus-operandi-theme-scale-2 1.1
        modus-operandi-theme-scale-3 1.15
        modus-operandi-theme-scale-4 1.2))
#+END_SRC

** Diminish

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package diminish
  :defer t
  :after use-package)
#+END_SRC

** Ivy

I use Ivy as as a completion frontend, it integrates really well with
other super cool tools such as Swiper and Counsel.  There are other
choices for this such as Helm that I don't really like or the default
Ido mode that I should try one day.

#+BEGIN_SRC emacs-lisp :tangle init.el
 (use-package counsel
   :defer t
   :diminish ivy-mode counsel-mode
   :bind (("C-s" . swiper-isearch))
   :hook ((after-init . ivy-mode)
          (ivy-mode . counsel-mode))
   :init
   (setq ivy-use-virtual-buffers t)
   (setq ivy-count-format "(%d/%d) "))
#+END_SRC

** Code Completion

I use =lsp-mode= as my completion tool.  Language Server Protocols
allows to use the most modern code completions since they use servers
as completion engines and =lsp-mode= is a great Emacs client for it.
I also use =company-mode= for the frontend completion.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package lsp-mode
  :defer t
  :init (setq lsp-keymap-prefix "C-c l")
  :hook ((python-mode . lsp)
         (go-mode . lsp)
         (ruby-mode . lsp)
         (typescript-mode . lsp)
         (rust-mdoe . lsp)
         (web-mode . lsp))
  :commands lsp
  :config
  ;; Do not use lsp for linting
  (setq lsp-diagnostic-package :none))

(use-package company-mode
  :defer t
  :diminish company-mode
  :init
  (setq company-selection-wrap-around t)
  (setq company-minimum-prefix-length 1)
  (setq company-idle-delay 0)
  (with-eval-after-load 'company
    (define-key company-active-map (kbd "M-n") nil)
    (define-key company-active-map (kbd "M-p") nil)
    (define-key company-active-map (kbd "C-n") 'company-select-next)
    (define-key company-active-map (kbd "C-p") 'company-select-previous))
  :ensure company
  :hook ((after-init . global-company-mode)
          (company-mode . (lambda ()
                            (diminish 'company-mode)))))

(use-package company-lsp
  :defer t
  :after (company lsp)
  :init
  (push 'company-lsp company-backends)
  :commands company-lsp)
#+END_SRC

** Org Mode

I use org mode fo lots of things epacially to write this file.  It's
just really great!

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package org
  :defer t
  :diminish visual-line-mode auto-fill-function
  :preface
  (defun hma/org-mode-hook ()
    (org-indent-mode 1)
    (visual-line-mode 1)
    (flyspell-mode 1)
    (auto-fill-mode 1)
    (variable-pitch-mode))
  :hook ((org-mode . hma/org-mode-hook)
         (org-indent-mode . (lambda ()
                              (diminish 'org-indent-mode)))
         (flyspell-mode . (lambda ()
                            (diminish 'flyspell-mode))))
  :config
  ;; Do not set headings face attributes if onve of the modus themes
  ;; is enabled since they already set this up.
  (set-face-attribute 'org-document-title nil :height 200)
  (unless (or (member 'modus-operandi custom-enabled-themes)
              (member 'modus-vivendi custom-enabled-themes))
    (set-face-attribute 'org-level-1        nil :height 160)
    (set-face-attribute 'org-level-2        nil :height 150))
  ;; Unbind C-<tab> to use 'next-buffer
  (define-key org-mode-map (kbd "C-<tab>") nil))

(use-package org-bullets
  :defer t
  :hook (org-mode . org-bullets-mode))

(use-package toc-org
  :defer t
  :hook ((org-mode      . toc-org-mode)
         (markdown-mode . toc-org-mode)))
#+END_SRC

** Markdown mode

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package markdown-mode
  :defer t
  :config
  (setq markdown-fontify-code-blocks-natively t))
#+END_SRC

** Magit

Magit is an awesome git wrapper, everyone loves it, I love it and I
use it everyday.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package magit
  :defer t
  :bind ("C-x g" . 'magit-status))
#+END_SRC

** Flycheck

Flycheck linter.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package flycheck
  :diminish
  :config (global-flycheck-mode t))
#+END_SRC

** Projectile

Testing =Projectile= for project management.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package projectile
  :defer t
  :diminish
  :config
  (projectile-mode t)
  (setq projectile-completion-system 'ivy)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))
#+END_SRC

** Neotree

Tree file structure for Emacs

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package neotree
  :defer t
  :config
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
  (setq neo-hidden-regexp-list '("\\.git$"))
  :bind (([f8] . neotree-toggle)))
#+END_SRC

** Which key

This is great to get a list of available commands while typing a key
chord.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode +1)
  (setq which-key-idle-delay 0.2
        which-key-idle-secondary-delay 0.2))
#+END_SRC

** Undo tree

Handy features for undo/redo

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package undo-tree
  :diminish undo-tree-mode
  :config
  (global-undo-tree-mode))
#+END_SRC

** All the icons

Icons support in Emacs

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package all-the-icons
  :defer t)
#+END_SRC

** Dashboard

I just think it's neat!

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package dashboard
  :diminish page-break-lines-mode
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner 'official
        dashboard-items '((bookmarks . 10)
                          (recents . 5))
        dashboard-center-content t
        dashboard-set-heading-icons t
        dashboard-set-file-icons    t
        dashboard-banner-logo-title "Welcome to He-Macs!"))
#+END_SRC

** Snippets

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package yasnippet
  :diminish yas-minor-mode
  :config (yas-global-mode t))
#+END_SRC

** Clojure

*** Clojure mode

Install =clojure-mode= for editing.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package clojure-mode
  :defer t)
#+END_SRC

*** CIDER

Install =CIDER= for REPL support and other intractive features.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package cider
  :defer t)
#+END_SRC

** Typescript

I use typescript mode instead of tide since I am already using lsp as
a completion engine.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package typescript-mode
  :defer t
  :config
  (setq typescript-indent-level 2))
#+END_SRC

** Docker

To provide support fo docker I use =docker-mode= which is a wrapper
for the Docker CLI and =dockerfile-mode= which allows syntax
highlighting for Dockerfiles.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package docker
  :defer t
  :bind ("C-c d" . docker))

(use-package dockerfile-mode)
#+END_SRC

** YAML

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package yaml-mode
  :defer t)
#+END_SRC

** Go

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package go-mode
  :defer t
  :config
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks))
#+END_SRC

