config.org
** LaTeX

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package tex
    :defer t
    :diminish auto-fill-function
    :ensure auctex
    :config
    ;; Disable auto locale
    (setq TeX-auto-local nil)
    ;; Set TEXINPUTS to recognize classes in custom directory on MacOS
    (when *is-a-mac*
      (setenv "TEXINPUTS" (concat (getenv "TEXINPUTS")
                                  ":$HOME/Documents/Notes/classes")))
    :hook (LaTeX-mode . (lambda () (auto-fill-mode 1)
                                   (set-fill-column 80))))
#+END_SRC
 
** RVM

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package rvm
  :config
  ;; Unset BUNDLE_PATH set by rvm because somehow it causes bundler to
  ;; install gems in another path than the default one
  (rvm-use-default)
  (setenv "BUNDLE_PATH"))
#+END_SRC

** Ruby

#+BEGIN_SRC emacs-lisp :tangle init.el
;; Auto close for ruby
(use-package ruby-electric
  :diminish ruby-electric-mode
  :defer t
  :hook (ruby-mode . ruby-electric-mode))
#+END_SRC

** Olivetty

Useful when writing prose.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package olivetti
  :defer t
  :config (setq olivetti-body-width 110))
#+END_SRC

** Terraform

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package terraform-mode
  :defer t
  :bind (("C-c SPC" . hma/align-equals)))
#+END_SRC

** Beacon

Never lose the cursor again.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package beacon
  :diminish beacon-mode
  :config (beacon-mode t))
#+END_SRC

** IMenu-list

Creates a side buffer with the a list of imenu.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package imenu-list
  :config (global-set-key (kbd "C-:") #'imenu-list-smart-toggle))
#+END_SRC

** Evil

It is treason then...

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package evil  
  :config
  ;; Switch on Evil mode
  (evil-mode t)
  ;; Default state is emacs so Evil is only active when toggling it
  ;; with `C-z'
  (setq evil-default-state 'emacs))
#+END_SRC

* Personal Packages

This part is about configuring packages that are not part of GNU Emacs
but written by me.  I chose not to upload them on MELPA since similar
version of thos packages already exists, I just didn't like them :)

** [[https://github.com/hmatheisen/new-term][New Term]]

This package allows to toggle a small terminal window on the bottom of
the screen.  It has a few other features like making it bigger or
smaller and quitting by closing the shell process and killing the
window.  It is somewhat similar to what you would find in more modern
editors such as VS Code.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package new-term
  :preface
  (defun hma/new-term-hook ()
    (define-key term-raw-map (kbd "C-c <up>") 'bigger-term-window)
    (define-key term-raw-map (kbd "C-c <down>") 'smaller-term-window)
    (define-key term-raw-map (kbd "C-c q") 'quit-term))
  :ensure nil
  :init
  (setq new-shell "/usr/local/bin/bash")
  (global-set-key (kbd "C-x t") 'toggle-term-window)
  (add-hook 'term-mode-hook 'hma/new-term-hook))
#+END_SRC

** [[https://github.com/hmatheisen/theme-switcher][Theme Switcher]]

This allows me to configure a theme for the day and a theme for the
night that automatically switches at given time.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package theme-switcher
  :ensure nil
  :init
  (setq day-hour 09)
  (setq night-hour 15)
  (setq day-theme 'modus-operandi)
  (setq night-theme 'modus-vivendi))
#+END_SRC

* Closing files

** =init.el=

#+BEGIN_SRC emacs-lisp :tangle init.el
;;; init.el ends here
#+END_SRC

